
aList = [1, 2, 4, 5, 6, 7, 8, 9]

# 在列表头部插入元素
aList[:0] = [-1,0]
print(aList)
# >>> [-1, 0, 1, 2, 4, 5, 6, 7, 8, 9]

# 在列表中间位置插入元素
aList[4:4] = [3]
print(aList)
# >>> [-1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 在列表尾部插入元素
aList[len(aList):] = [10, 11]
print(aList)
# >>> [-1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

# 替换列表元素
aList[2:4] = [2,2]
print(aList)
# >>> [-1, 0, 2, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

# 隔一个修改一个, [0]*7 == [0, 0, 0, 0, 0, 0, 0]
aList[::2] = ['!']*7
print(aList)
# >>> ['!', 0, '!', 2, '!', 4, '!', 6, '!', 8, '!', 10, '!']

# 删除列表中前几个元素
aList[:2] = []
print(aList)
# >>> ['!', 2, '!', 4, '!', 6, '!', 8, '!', 10, '!']